The following result is generated by torchsummary:

----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1        [-1, 4, 32, 32, 32]             112
       BatchNorm3d-2        [-1, 4, 32, 32, 32]               8
              ReLU-3        [-1, 4, 32, 32, 32]               0
              ReLU-4        [-1, 4, 32, 32, 32]               0
              ReLU-5        [-1, 4, 32, 32, 32]               0
              ReLU-6        [-1, 4, 32, 32, 32]               0
              ReLU-7        [-1, 4, 32, 32, 32]               0
              ReLU-8        [-1, 4, 32, 32, 32]               0
              ReLU-9        [-1, 4, 32, 32, 32]               0
             ReLU-10        [-1, 4, 32, 32, 32]               0
             ReLU-11        [-1, 4, 32, 32, 32]               0
             ReLU-12        [-1, 4, 32, 32, 32]               0
             ReLU-13        [-1, 4, 32, 32, 32]               0
             ReLU-14        [-1, 4, 32, 32, 32]               0
             ReLU-15        [-1, 4, 32, 32, 32]               0
             ReLU-16        [-1, 4, 32, 32, 32]               0
             ReLU-17        [-1, 4, 32, 32, 32]               0
             ReLU-18        [-1, 4, 32, 32, 32]               0
             ReLU-19        [-1, 4, 32, 32, 32]               0
           Conv3d-20       [-1, 16, 32, 32, 32]           1,744
      BatchNorm3d-21       [-1, 16, 32, 32, 32]              32
           Conv3d-22       [-1, 16, 32, 32, 32]              32
      BatchNorm3d-23       [-1, 16, 32, 32, 32]              32
             ReLU-24       [-1, 16, 32, 32, 32]               0
             ReLU-25       [-1, 16, 32, 32, 32]               0
             ReLU-26       [-1, 16, 32, 32, 32]               0
             ReLU-27       [-1, 16, 32, 32, 32]               0
             ReLU-28       [-1, 16, 32, 32, 32]               0
             ReLU-29       [-1, 16, 32, 32, 32]               0
             ReLU-30       [-1, 16, 32, 32, 32]               0
             ReLU-31       [-1, 16, 32, 32, 32]               0
             ReLU-32       [-1, 16, 32, 32, 32]               0
             ReLU-33       [-1, 16, 32, 32, 32]               0
             ReLU-34       [-1, 16, 32, 32, 32]               0
             ReLU-35       [-1, 16, 32, 32, 32]               0
             ReLU-36       [-1, 16, 32, 32, 32]               0
             ReLU-37       [-1, 16, 32, 32, 32]               0
             ReLU-38       [-1, 16, 32, 32, 32]               0
             ReLU-39       [-1, 16, 32, 32, 32]               0
             ReLU-40       [-1, 16, 32, 32, 32]               0
        ConvBlock-41       [-1, 16, 32, 32, 32]               0
           Conv3d-42        [-1, 4, 32, 32, 32]           1,732
      BatchNorm3d-43        [-1, 4, 32, 32, 32]               8
             ReLU-44        [-1, 4, 32, 32, 32]               0
             ReLU-45        [-1, 4, 32, 32, 32]               0
             ReLU-46        [-1, 4, 32, 32, 32]               0
             ReLU-47        [-1, 4, 32, 32, 32]               0
             ReLU-48        [-1, 4, 32, 32, 32]               0
             ReLU-49        [-1, 4, 32, 32, 32]               0
             ReLU-50        [-1, 4, 32, 32, 32]               0
             ReLU-51        [-1, 4, 32, 32, 32]               0
             ReLU-52        [-1, 4, 32, 32, 32]               0
             ReLU-53        [-1, 4, 32, 32, 32]               0
             ReLU-54        [-1, 4, 32, 32, 32]               0
             ReLU-55        [-1, 4, 32, 32, 32]               0
             ReLU-56        [-1, 4, 32, 32, 32]               0
             ReLU-57        [-1, 4, 32, 32, 32]               0
             ReLU-58        [-1, 4, 32, 32, 32]               0
             ReLU-59        [-1, 4, 32, 32, 32]               0
             ReLU-60        [-1, 4, 32, 32, 32]               0
           Conv3d-61       [-1, 16, 32, 32, 32]           1,744
      BatchNorm3d-62       [-1, 16, 32, 32, 32]              32
             ReLU-63       [-1, 16, 32, 32, 32]               0
             ReLU-64       [-1, 16, 32, 32, 32]               0
             ReLU-65       [-1, 16, 32, 32, 32]               0
             ReLU-66       [-1, 16, 32, 32, 32]               0
             ReLU-67       [-1, 16, 32, 32, 32]               0
             ReLU-68       [-1, 16, 32, 32, 32]               0
             ReLU-69       [-1, 16, 32, 32, 32]               0
             ReLU-70       [-1, 16, 32, 32, 32]               0
             ReLU-71       [-1, 16, 32, 32, 32]               0
             ReLU-72       [-1, 16, 32, 32, 32]               0
             ReLU-73       [-1, 16, 32, 32, 32]               0
             ReLU-74       [-1, 16, 32, 32, 32]               0
             ReLU-75       [-1, 16, 32, 32, 32]               0
             ReLU-76       [-1, 16, 32, 32, 32]               0
             ReLU-77       [-1, 16, 32, 32, 32]               0
             ReLU-78       [-1, 16, 32, 32, 32]               0
             ReLU-79       [-1, 16, 32, 32, 32]               0
    IdentityBlock-80       [-1, 16, 32, 32, 32]               0
           Conv3d-81        [-1, 8, 16, 16, 16]           3,464
      BatchNorm3d-82        [-1, 8, 16, 16, 16]              16
             ReLU-83        [-1, 8, 16, 16, 16]               0
             ReLU-84        [-1, 8, 16, 16, 16]               0
             ReLU-85        [-1, 8, 16, 16, 16]               0
             ReLU-86        [-1, 8, 16, 16, 16]               0
             ReLU-87        [-1, 8, 16, 16, 16]               0
             ReLU-88        [-1, 8, 16, 16, 16]               0
             ReLU-89        [-1, 8, 16, 16, 16]               0
             ReLU-90        [-1, 8, 16, 16, 16]               0
             ReLU-91        [-1, 8, 16, 16, 16]               0
             ReLU-92        [-1, 8, 16, 16, 16]               0
             ReLU-93        [-1, 8, 16, 16, 16]               0
             ReLU-94        [-1, 8, 16, 16, 16]               0
             ReLU-95        [-1, 8, 16, 16, 16]               0
             ReLU-96        [-1, 8, 16, 16, 16]               0
             ReLU-97        [-1, 8, 16, 16, 16]               0
             ReLU-98        [-1, 8, 16, 16, 16]               0
             ReLU-99        [-1, 8, 16, 16, 16]               0
          Conv3d-100       [-1, 32, 16, 16, 16]           6,944
     BatchNorm3d-101       [-1, 32, 16, 16, 16]              64
          Conv3d-102       [-1, 32, 16, 16, 16]             544
     BatchNorm3d-103       [-1, 32, 16, 16, 16]              64
            ReLU-104       [-1, 32, 16, 16, 16]               0
            ReLU-105       [-1, 32, 16, 16, 16]               0
            ReLU-106       [-1, 32, 16, 16, 16]               0
            ReLU-107       [-1, 32, 16, 16, 16]               0
            ReLU-108       [-1, 32, 16, 16, 16]               0
            ReLU-109       [-1, 32, 16, 16, 16]               0
            ReLU-110       [-1, 32, 16, 16, 16]               0
            ReLU-111       [-1, 32, 16, 16, 16]               0
            ReLU-112       [-1, 32, 16, 16, 16]               0
            ReLU-113       [-1, 32, 16, 16, 16]               0
            ReLU-114       [-1, 32, 16, 16, 16]               0
            ReLU-115       [-1, 32, 16, 16, 16]               0
            ReLU-116       [-1, 32, 16, 16, 16]               0
            ReLU-117       [-1, 32, 16, 16, 16]               0
            ReLU-118       [-1, 32, 16, 16, 16]               0
            ReLU-119       [-1, 32, 16, 16, 16]               0
            ReLU-120       [-1, 32, 16, 16, 16]               0
       ConvBlock-121       [-1, 32, 16, 16, 16]               0
          Conv3d-122        [-1, 8, 16, 16, 16]           6,920
     BatchNorm3d-123        [-1, 8, 16, 16, 16]              16
            ReLU-124        [-1, 8, 16, 16, 16]               0
            ReLU-125        [-1, 8, 16, 16, 16]               0
            ReLU-126        [-1, 8, 16, 16, 16]               0
            ReLU-127        [-1, 8, 16, 16, 16]               0
            ReLU-128        [-1, 8, 16, 16, 16]               0
            ReLU-129        [-1, 8, 16, 16, 16]               0
            ReLU-130        [-1, 8, 16, 16, 16]               0
            ReLU-131        [-1, 8, 16, 16, 16]               0
            ReLU-132        [-1, 8, 16, 16, 16]               0
            ReLU-133        [-1, 8, 16, 16, 16]               0
            ReLU-134        [-1, 8, 16, 16, 16]               0
            ReLU-135        [-1, 8, 16, 16, 16]               0
            ReLU-136        [-1, 8, 16, 16, 16]               0
            ReLU-137        [-1, 8, 16, 16, 16]               0
            ReLU-138        [-1, 8, 16, 16, 16]               0
            ReLU-139        [-1, 8, 16, 16, 16]               0
            ReLU-140        [-1, 8, 16, 16, 16]               0
          Conv3d-141       [-1, 32, 16, 16, 16]           6,944
     BatchNorm3d-142       [-1, 32, 16, 16, 16]              64
            ReLU-143       [-1, 32, 16, 16, 16]               0
            ReLU-144       [-1, 32, 16, 16, 16]               0
            ReLU-145       [-1, 32, 16, 16, 16]               0
            ReLU-146       [-1, 32, 16, 16, 16]               0
            ReLU-147       [-1, 32, 16, 16, 16]               0
            ReLU-148       [-1, 32, 16, 16, 16]               0
            ReLU-149       [-1, 32, 16, 16, 16]               0
            ReLU-150       [-1, 32, 16, 16, 16]               0
            ReLU-151       [-1, 32, 16, 16, 16]               0
            ReLU-152       [-1, 32, 16, 16, 16]               0
            ReLU-153       [-1, 32, 16, 16, 16]               0
            ReLU-154       [-1, 32, 16, 16, 16]               0
            ReLU-155       [-1, 32, 16, 16, 16]               0
            ReLU-156       [-1, 32, 16, 16, 16]               0
            ReLU-157       [-1, 32, 16, 16, 16]               0
            ReLU-158       [-1, 32, 16, 16, 16]               0
            ReLU-159       [-1, 32, 16, 16, 16]               0
   IdentityBlock-160       [-1, 32, 16, 16, 16]               0
          Conv3d-161          [-1, 16, 8, 8, 8]          13,840
     BatchNorm3d-162          [-1, 16, 8, 8, 8]              32
            ReLU-163          [-1, 16, 8, 8, 8]               0
            ReLU-164          [-1, 16, 8, 8, 8]               0
            ReLU-165          [-1, 16, 8, 8, 8]               0
            ReLU-166          [-1, 16, 8, 8, 8]               0
            ReLU-167          [-1, 16, 8, 8, 8]               0
            ReLU-168          [-1, 16, 8, 8, 8]               0
            ReLU-169          [-1, 16, 8, 8, 8]               0
            ReLU-170          [-1, 16, 8, 8, 8]               0
            ReLU-171          [-1, 16, 8, 8, 8]               0
            ReLU-172          [-1, 16, 8, 8, 8]               0
            ReLU-173          [-1, 16, 8, 8, 8]               0
            ReLU-174          [-1, 16, 8, 8, 8]               0
            ReLU-175          [-1, 16, 8, 8, 8]               0
            ReLU-176          [-1, 16, 8, 8, 8]               0
            ReLU-177          [-1, 16, 8, 8, 8]               0
            ReLU-178          [-1, 16, 8, 8, 8]               0
            ReLU-179          [-1, 16, 8, 8, 8]               0
          Conv3d-180          [-1, 64, 8, 8, 8]          27,712
     BatchNorm3d-181          [-1, 64, 8, 8, 8]             128
          Conv3d-182          [-1, 64, 8, 8, 8]           2,112
     BatchNorm3d-183          [-1, 64, 8, 8, 8]             128
            ReLU-184          [-1, 64, 8, 8, 8]               0
            ReLU-185          [-1, 64, 8, 8, 8]               0
            ReLU-186          [-1, 64, 8, 8, 8]               0
            ReLU-187          [-1, 64, 8, 8, 8]               0
            ReLU-188          [-1, 64, 8, 8, 8]               0
            ReLU-189          [-1, 64, 8, 8, 8]               0
            ReLU-190          [-1, 64, 8, 8, 8]               0
            ReLU-191          [-1, 64, 8, 8, 8]               0
            ReLU-192          [-1, 64, 8, 8, 8]               0
            ReLU-193          [-1, 64, 8, 8, 8]               0
            ReLU-194          [-1, 64, 8, 8, 8]               0
            ReLU-195          [-1, 64, 8, 8, 8]               0
            ReLU-196          [-1, 64, 8, 8, 8]               0
            ReLU-197          [-1, 64, 8, 8, 8]               0
            ReLU-198          [-1, 64, 8, 8, 8]               0
            ReLU-199          [-1, 64, 8, 8, 8]               0
            ReLU-200          [-1, 64, 8, 8, 8]               0
       ConvBlock-201          [-1, 64, 8, 8, 8]               0
          Conv3d-202          [-1, 16, 8, 8, 8]          27,664
     BatchNorm3d-203          [-1, 16, 8, 8, 8]              32
            ReLU-204          [-1, 16, 8, 8, 8]               0
            ReLU-205          [-1, 16, 8, 8, 8]               0
            ReLU-206          [-1, 16, 8, 8, 8]               0
            ReLU-207          [-1, 16, 8, 8, 8]               0
            ReLU-208          [-1, 16, 8, 8, 8]               0
            ReLU-209          [-1, 16, 8, 8, 8]               0
            ReLU-210          [-1, 16, 8, 8, 8]               0
            ReLU-211          [-1, 16, 8, 8, 8]               0
            ReLU-212          [-1, 16, 8, 8, 8]               0
            ReLU-213          [-1, 16, 8, 8, 8]               0
            ReLU-214          [-1, 16, 8, 8, 8]               0
            ReLU-215          [-1, 16, 8, 8, 8]               0
            ReLU-216          [-1, 16, 8, 8, 8]               0
            ReLU-217          [-1, 16, 8, 8, 8]               0
            ReLU-218          [-1, 16, 8, 8, 8]               0
            ReLU-219          [-1, 16, 8, 8, 8]               0
            ReLU-220          [-1, 16, 8, 8, 8]               0
          Conv3d-221          [-1, 64, 8, 8, 8]          27,712
     BatchNorm3d-222          [-1, 64, 8, 8, 8]             128
            ReLU-223          [-1, 64, 8, 8, 8]               0
            ReLU-224          [-1, 64, 8, 8, 8]               0
            ReLU-225          [-1, 64, 8, 8, 8]               0
            ReLU-226          [-1, 64, 8, 8, 8]               0
            ReLU-227          [-1, 64, 8, 8, 8]               0
            ReLU-228          [-1, 64, 8, 8, 8]               0
            ReLU-229          [-1, 64, 8, 8, 8]               0
            ReLU-230          [-1, 64, 8, 8, 8]               0
            ReLU-231          [-1, 64, 8, 8, 8]               0
            ReLU-232          [-1, 64, 8, 8, 8]               0
            ReLU-233          [-1, 64, 8, 8, 8]               0
            ReLU-234          [-1, 64, 8, 8, 8]               0
            ReLU-235          [-1, 64, 8, 8, 8]               0
            ReLU-236          [-1, 64, 8, 8, 8]               0
            ReLU-237          [-1, 64, 8, 8, 8]               0
            ReLU-238          [-1, 64, 8, 8, 8]               0
            ReLU-239          [-1, 64, 8, 8, 8]               0
   IdentityBlock-240          [-1, 64, 8, 8, 8]               0
          Conv3d-241          [-1, 32, 4, 4, 4]          55,328
     BatchNorm3d-242          [-1, 32, 4, 4, 4]              64
            ReLU-243          [-1, 32, 4, 4, 4]               0
            ReLU-244          [-1, 32, 4, 4, 4]               0
            ReLU-245          [-1, 32, 4, 4, 4]               0
            ReLU-246          [-1, 32, 4, 4, 4]               0
            ReLU-247          [-1, 32, 4, 4, 4]               0
            ReLU-248          [-1, 32, 4, 4, 4]               0
            ReLU-249          [-1, 32, 4, 4, 4]               0
            ReLU-250          [-1, 32, 4, 4, 4]               0
            ReLU-251          [-1, 32, 4, 4, 4]               0
            ReLU-252          [-1, 32, 4, 4, 4]               0
            ReLU-253          [-1, 32, 4, 4, 4]               0
            ReLU-254          [-1, 32, 4, 4, 4]               0
            ReLU-255          [-1, 32, 4, 4, 4]               0
            ReLU-256          [-1, 32, 4, 4, 4]               0
            ReLU-257          [-1, 32, 4, 4, 4]               0
            ReLU-258          [-1, 32, 4, 4, 4]               0
            ReLU-259          [-1, 32, 4, 4, 4]               0
          Conv3d-260         [-1, 128, 4, 4, 4]         110,720
     BatchNorm3d-261         [-1, 128, 4, 4, 4]             256
          Conv3d-262         [-1, 128, 4, 4, 4]           8,320
     BatchNorm3d-263         [-1, 128, 4, 4, 4]             256
            ReLU-264         [-1, 128, 4, 4, 4]               0
            ReLU-265         [-1, 128, 4, 4, 4]               0
            ReLU-266         [-1, 128, 4, 4, 4]               0
            ReLU-267         [-1, 128, 4, 4, 4]               0
            ReLU-268         [-1, 128, 4, 4, 4]               0
            ReLU-269         [-1, 128, 4, 4, 4]               0
            ReLU-270         [-1, 128, 4, 4, 4]               0
            ReLU-271         [-1, 128, 4, 4, 4]               0
            ReLU-272         [-1, 128, 4, 4, 4]               0
            ReLU-273         [-1, 128, 4, 4, 4]               0
            ReLU-274         [-1, 128, 4, 4, 4]               0
            ReLU-275         [-1, 128, 4, 4, 4]               0
            ReLU-276         [-1, 128, 4, 4, 4]               0
            ReLU-277         [-1, 128, 4, 4, 4]               0
            ReLU-278         [-1, 128, 4, 4, 4]               0
            ReLU-279         [-1, 128, 4, 4, 4]               0
            ReLU-280         [-1, 128, 4, 4, 4]               0
       ConvBlock-281         [-1, 128, 4, 4, 4]               0
          Conv3d-282          [-1, 32, 4, 4, 4]         110,624
     BatchNorm3d-283          [-1, 32, 4, 4, 4]              64
            ReLU-284          [-1, 32, 4, 4, 4]               0
            ReLU-285          [-1, 32, 4, 4, 4]               0
            ReLU-286          [-1, 32, 4, 4, 4]               0
            ReLU-287          [-1, 32, 4, 4, 4]               0
            ReLU-288          [-1, 32, 4, 4, 4]               0
            ReLU-289          [-1, 32, 4, 4, 4]               0
            ReLU-290          [-1, 32, 4, 4, 4]               0
            ReLU-291          [-1, 32, 4, 4, 4]               0
            ReLU-292          [-1, 32, 4, 4, 4]               0
            ReLU-293          [-1, 32, 4, 4, 4]               0
            ReLU-294          [-1, 32, 4, 4, 4]               0
            ReLU-295          [-1, 32, 4, 4, 4]               0
            ReLU-296          [-1, 32, 4, 4, 4]               0
            ReLU-297          [-1, 32, 4, 4, 4]               0
            ReLU-298          [-1, 32, 4, 4, 4]               0
            ReLU-299          [-1, 32, 4, 4, 4]               0
            ReLU-300          [-1, 32, 4, 4, 4]               0
          Conv3d-301         [-1, 128, 4, 4, 4]         110,720
     BatchNorm3d-302         [-1, 128, 4, 4, 4]             256
            ReLU-303         [-1, 128, 4, 4, 4]               0
            ReLU-304         [-1, 128, 4, 4, 4]               0
            ReLU-305         [-1, 128, 4, 4, 4]               0
            ReLU-306         [-1, 128, 4, 4, 4]               0
            ReLU-307         [-1, 128, 4, 4, 4]               0
            ReLU-308         [-1, 128, 4, 4, 4]               0
            ReLU-309         [-1, 128, 4, 4, 4]               0
            ReLU-310         [-1, 128, 4, 4, 4]               0
            ReLU-311         [-1, 128, 4, 4, 4]               0
            ReLU-312         [-1, 128, 4, 4, 4]               0
            ReLU-313         [-1, 128, 4, 4, 4]               0
            ReLU-314         [-1, 128, 4, 4, 4]               0
            ReLU-315         [-1, 128, 4, 4, 4]               0
            ReLU-316         [-1, 128, 4, 4, 4]               0
            ReLU-317         [-1, 128, 4, 4, 4]               0
            ReLU-318         [-1, 128, 4, 4, 4]               0
            ReLU-319         [-1, 128, 4, 4, 4]               0
   IdentityBlock-320         [-1, 128, 4, 4, 4]               0
          Linear-321                  [-1, 400]       3,277,200
          Linear-322                  [-1, 400]       3,277,200
      VAEEncoder-323  [[-1, 400], [-1, 400], [-1, 400]]               0
          Linear-324                 [-1, 8192]       3,284,992
        Upsample-325         [-1, 128, 8, 8, 8]               0
          Conv3d-326          [-1, 16, 8, 8, 8]          55,312
     BatchNorm3d-327          [-1, 16, 8, 8, 8]              32
            ReLU-328          [-1, 16, 8, 8, 8]               0
            ReLU-329          [-1, 16, 8, 8, 8]               0
            ReLU-330          [-1, 16, 8, 8, 8]               0
            ReLU-331          [-1, 16, 8, 8, 8]               0
            ReLU-332          [-1, 16, 8, 8, 8]               0
            ReLU-333          [-1, 16, 8, 8, 8]               0
            ReLU-334          [-1, 16, 8, 8, 8]               0
            ReLU-335          [-1, 16, 8, 8, 8]               0
            ReLU-336          [-1, 16, 8, 8, 8]               0
            ReLU-337          [-1, 16, 8, 8, 8]               0
            ReLU-338          [-1, 16, 8, 8, 8]               0
            ReLU-339          [-1, 16, 8, 8, 8]               0
            ReLU-340          [-1, 16, 8, 8, 8]               0
            ReLU-341          [-1, 16, 8, 8, 8]               0
            ReLU-342          [-1, 16, 8, 8, 8]               0
            ReLU-343          [-1, 16, 8, 8, 8]               0
            ReLU-344          [-1, 16, 8, 8, 8]               0
          Conv3d-345          [-1, 64, 8, 8, 8]          27,712
     BatchNorm3d-346          [-1, 64, 8, 8, 8]             128
          Conv3d-347          [-1, 64, 8, 8, 8]           8,256
     BatchNorm3d-348          [-1, 64, 8, 8, 8]             128
            ReLU-349          [-1, 64, 8, 8, 8]               0
            ReLU-350          [-1, 64, 8, 8, 8]               0
            ReLU-351          [-1, 64, 8, 8, 8]               0
            ReLU-352          [-1, 64, 8, 8, 8]               0
            ReLU-353          [-1, 64, 8, 8, 8]               0
            ReLU-354          [-1, 64, 8, 8, 8]               0
            ReLU-355          [-1, 64, 8, 8, 8]               0
            ReLU-356          [-1, 64, 8, 8, 8]               0
            ReLU-357          [-1, 64, 8, 8, 8]               0
            ReLU-358          [-1, 64, 8, 8, 8]               0
            ReLU-359          [-1, 64, 8, 8, 8]               0
            ReLU-360          [-1, 64, 8, 8, 8]               0
            ReLU-361          [-1, 64, 8, 8, 8]               0
            ReLU-362          [-1, 64, 8, 8, 8]               0
            ReLU-363          [-1, 64, 8, 8, 8]               0
            ReLU-364          [-1, 64, 8, 8, 8]               0
            ReLU-365          [-1, 64, 8, 8, 8]               0
       ConvBlock-366          [-1, 64, 8, 8, 8]               0
          Conv3d-367          [-1, 16, 8, 8, 8]          27,664
     BatchNorm3d-368          [-1, 16, 8, 8, 8]              32
            ReLU-369          [-1, 16, 8, 8, 8]               0
            ReLU-370          [-1, 16, 8, 8, 8]               0
            ReLU-371          [-1, 16, 8, 8, 8]               0
            ReLU-372          [-1, 16, 8, 8, 8]               0
            ReLU-373          [-1, 16, 8, 8, 8]               0
            ReLU-374          [-1, 16, 8, 8, 8]               0
            ReLU-375          [-1, 16, 8, 8, 8]               0
            ReLU-376          [-1, 16, 8, 8, 8]               0
            ReLU-377          [-1, 16, 8, 8, 8]               0
            ReLU-378          [-1, 16, 8, 8, 8]               0
            ReLU-379          [-1, 16, 8, 8, 8]               0
            ReLU-380          [-1, 16, 8, 8, 8]               0
            ReLU-381          [-1, 16, 8, 8, 8]               0
            ReLU-382          [-1, 16, 8, 8, 8]               0
            ReLU-383          [-1, 16, 8, 8, 8]               0
            ReLU-384          [-1, 16, 8, 8, 8]               0
            ReLU-385          [-1, 16, 8, 8, 8]               0
          Conv3d-386          [-1, 64, 8, 8, 8]          27,712
     BatchNorm3d-387          [-1, 64, 8, 8, 8]             128
            ReLU-388          [-1, 64, 8, 8, 8]               0
            ReLU-389          [-1, 64, 8, 8, 8]               0
            ReLU-390          [-1, 64, 8, 8, 8]               0
            ReLU-391          [-1, 64, 8, 8, 8]               0
            ReLU-392          [-1, 64, 8, 8, 8]               0
            ReLU-393          [-1, 64, 8, 8, 8]               0
            ReLU-394          [-1, 64, 8, 8, 8]               0
            ReLU-395          [-1, 64, 8, 8, 8]               0
            ReLU-396          [-1, 64, 8, 8, 8]               0
            ReLU-397          [-1, 64, 8, 8, 8]               0
            ReLU-398          [-1, 64, 8, 8, 8]               0
            ReLU-399          [-1, 64, 8, 8, 8]               0
            ReLU-400          [-1, 64, 8, 8, 8]               0
            ReLU-401          [-1, 64, 8, 8, 8]               0
            ReLU-402          [-1, 64, 8, 8, 8]               0
            ReLU-403          [-1, 64, 8, 8, 8]               0
            ReLU-404          [-1, 64, 8, 8, 8]               0
   IdentityBlock-405          [-1, 64, 8, 8, 8]               0
        Upsample-406       [-1, 64, 16, 16, 16]               0
          Conv3d-407        [-1, 8, 16, 16, 16]          13,832
     BatchNorm3d-408        [-1, 8, 16, 16, 16]              16
            ReLU-409        [-1, 8, 16, 16, 16]               0
            ReLU-410        [-1, 8, 16, 16, 16]               0
            ReLU-411        [-1, 8, 16, 16, 16]               0
            ReLU-412        [-1, 8, 16, 16, 16]               0
            ReLU-413        [-1, 8, 16, 16, 16]               0
            ReLU-414        [-1, 8, 16, 16, 16]               0
            ReLU-415        [-1, 8, 16, 16, 16]               0
            ReLU-416        [-1, 8, 16, 16, 16]               0
            ReLU-417        [-1, 8, 16, 16, 16]               0
            ReLU-418        [-1, 8, 16, 16, 16]               0
            ReLU-419        [-1, 8, 16, 16, 16]               0
            ReLU-420        [-1, 8, 16, 16, 16]               0
            ReLU-421        [-1, 8, 16, 16, 16]               0
            ReLU-422        [-1, 8, 16, 16, 16]               0
            ReLU-423        [-1, 8, 16, 16, 16]               0
            ReLU-424        [-1, 8, 16, 16, 16]               0
            ReLU-425        [-1, 8, 16, 16, 16]               0
          Conv3d-426       [-1, 32, 16, 16, 16]           6,944
     BatchNorm3d-427       [-1, 32, 16, 16, 16]              64
          Conv3d-428       [-1, 32, 16, 16, 16]           2,080
     BatchNorm3d-429       [-1, 32, 16, 16, 16]              64
            ReLU-430       [-1, 32, 16, 16, 16]               0
            ReLU-431       [-1, 32, 16, 16, 16]               0
            ReLU-432       [-1, 32, 16, 16, 16]               0
            ReLU-433       [-1, 32, 16, 16, 16]               0
            ReLU-434       [-1, 32, 16, 16, 16]               0
            ReLU-435       [-1, 32, 16, 16, 16]               0
            ReLU-436       [-1, 32, 16, 16, 16]               0
            ReLU-437       [-1, 32, 16, 16, 16]               0
            ReLU-438       [-1, 32, 16, 16, 16]               0
            ReLU-439       [-1, 32, 16, 16, 16]               0
            ReLU-440       [-1, 32, 16, 16, 16]               0
            ReLU-441       [-1, 32, 16, 16, 16]               0
            ReLU-442       [-1, 32, 16, 16, 16]               0
            ReLU-443       [-1, 32, 16, 16, 16]               0
            ReLU-444       [-1, 32, 16, 16, 16]               0
            ReLU-445       [-1, 32, 16, 16, 16]               0
            ReLU-446       [-1, 32, 16, 16, 16]               0
       ConvBlock-447       [-1, 32, 16, 16, 16]               0
          Conv3d-448        [-1, 8, 16, 16, 16]           6,920
     BatchNorm3d-449        [-1, 8, 16, 16, 16]              16
            ReLU-450        [-1, 8, 16, 16, 16]               0
            ReLU-451        [-1, 8, 16, 16, 16]               0
            ReLU-452        [-1, 8, 16, 16, 16]               0
            ReLU-453        [-1, 8, 16, 16, 16]               0
            ReLU-454        [-1, 8, 16, 16, 16]               0
            ReLU-455        [-1, 8, 16, 16, 16]               0
            ReLU-456        [-1, 8, 16, 16, 16]               0
            ReLU-457        [-1, 8, 16, 16, 16]               0
            ReLU-458        [-1, 8, 16, 16, 16]               0
            ReLU-459        [-1, 8, 16, 16, 16]               0
            ReLU-460        [-1, 8, 16, 16, 16]               0
            ReLU-461        [-1, 8, 16, 16, 16]               0
            ReLU-462        [-1, 8, 16, 16, 16]               0
            ReLU-463        [-1, 8, 16, 16, 16]               0
            ReLU-464        [-1, 8, 16, 16, 16]               0
            ReLU-465        [-1, 8, 16, 16, 16]               0
            ReLU-466        [-1, 8, 16, 16, 16]               0
          Conv3d-467       [-1, 32, 16, 16, 16]           6,944
     BatchNorm3d-468       [-1, 32, 16, 16, 16]              64
            ReLU-469       [-1, 32, 16, 16, 16]               0
            ReLU-470       [-1, 32, 16, 16, 16]               0
            ReLU-471       [-1, 32, 16, 16, 16]               0
            ReLU-472       [-1, 32, 16, 16, 16]               0
            ReLU-473       [-1, 32, 16, 16, 16]               0
            ReLU-474       [-1, 32, 16, 16, 16]               0
            ReLU-475       [-1, 32, 16, 16, 16]               0
            ReLU-476       [-1, 32, 16, 16, 16]               0
            ReLU-477       [-1, 32, 16, 16, 16]               0
            ReLU-478       [-1, 32, 16, 16, 16]               0
            ReLU-479       [-1, 32, 16, 16, 16]               0
            ReLU-480       [-1, 32, 16, 16, 16]               0
            ReLU-481       [-1, 32, 16, 16, 16]               0
            ReLU-482       [-1, 32, 16, 16, 16]               0
            ReLU-483       [-1, 32, 16, 16, 16]               0
            ReLU-484       [-1, 32, 16, 16, 16]               0
            ReLU-485       [-1, 32, 16, 16, 16]               0
   IdentityBlock-486       [-1, 32, 16, 16, 16]               0
        Upsample-487       [-1, 32, 32, 32, 32]               0
          Conv3d-488        [-1, 4, 32, 32, 32]           3,460
     BatchNorm3d-489        [-1, 4, 32, 32, 32]               8
            ReLU-490        [-1, 4, 32, 32, 32]               0
            ReLU-491        [-1, 4, 32, 32, 32]               0
            ReLU-492        [-1, 4, 32, 32, 32]               0
            ReLU-493        [-1, 4, 32, 32, 32]               0
            ReLU-494        [-1, 4, 32, 32, 32]               0
            ReLU-495        [-1, 4, 32, 32, 32]               0
            ReLU-496        [-1, 4, 32, 32, 32]               0
            ReLU-497        [-1, 4, 32, 32, 32]               0
            ReLU-498        [-1, 4, 32, 32, 32]               0
            ReLU-499        [-1, 4, 32, 32, 32]               0
            ReLU-500        [-1, 4, 32, 32, 32]               0
            ReLU-501        [-1, 4, 32, 32, 32]               0
            ReLU-502        [-1, 4, 32, 32, 32]               0
            ReLU-503        [-1, 4, 32, 32, 32]               0
            ReLU-504        [-1, 4, 32, 32, 32]               0
            ReLU-505        [-1, 4, 32, 32, 32]               0
            ReLU-506        [-1, 4, 32, 32, 32]               0
          Conv3d-507       [-1, 16, 32, 32, 32]           1,744
     BatchNorm3d-508       [-1, 16, 32, 32, 32]              32
          Conv3d-509       [-1, 16, 32, 32, 32]             528
     BatchNorm3d-510       [-1, 16, 32, 32, 32]              32
            ReLU-511       [-1, 16, 32, 32, 32]               0
            ReLU-512       [-1, 16, 32, 32, 32]               0
            ReLU-513       [-1, 16, 32, 32, 32]               0
            ReLU-514       [-1, 16, 32, 32, 32]               0
            ReLU-515       [-1, 16, 32, 32, 32]               0
            ReLU-516       [-1, 16, 32, 32, 32]               0
            ReLU-517       [-1, 16, 32, 32, 32]               0
            ReLU-518       [-1, 16, 32, 32, 32]               0
            ReLU-519       [-1, 16, 32, 32, 32]               0
            ReLU-520       [-1, 16, 32, 32, 32]               0
            ReLU-521       [-1, 16, 32, 32, 32]               0
            ReLU-522       [-1, 16, 32, 32, 32]               0
            ReLU-523       [-1, 16, 32, 32, 32]               0
            ReLU-524       [-1, 16, 32, 32, 32]               0
            ReLU-525       [-1, 16, 32, 32, 32]               0
            ReLU-526       [-1, 16, 32, 32, 32]               0
            ReLU-527       [-1, 16, 32, 32, 32]               0
       ConvBlock-528       [-1, 16, 32, 32, 32]               0
          Conv3d-529        [-1, 4, 32, 32, 32]           1,732
     BatchNorm3d-530        [-1, 4, 32, 32, 32]               8
            ReLU-531        [-1, 4, 32, 32, 32]               0
            ReLU-532        [-1, 4, 32, 32, 32]               0
            ReLU-533        [-1, 4, 32, 32, 32]               0
            ReLU-534        [-1, 4, 32, 32, 32]               0
            ReLU-535        [-1, 4, 32, 32, 32]               0
            ReLU-536        [-1, 4, 32, 32, 32]               0
            ReLU-537        [-1, 4, 32, 32, 32]               0
            ReLU-538        [-1, 4, 32, 32, 32]               0
            ReLU-539        [-1, 4, 32, 32, 32]               0
            ReLU-540        [-1, 4, 32, 32, 32]               0
            ReLU-541        [-1, 4, 32, 32, 32]               0
            ReLU-542        [-1, 4, 32, 32, 32]               0
            ReLU-543        [-1, 4, 32, 32, 32]               0
            ReLU-544        [-1, 4, 32, 32, 32]               0
            ReLU-545        [-1, 4, 32, 32, 32]               0
            ReLU-546        [-1, 4, 32, 32, 32]               0
            ReLU-547        [-1, 4, 32, 32, 32]               0
          Conv3d-548       [-1, 16, 32, 32, 32]           1,744
     BatchNorm3d-549       [-1, 16, 32, 32, 32]              32
            ReLU-550       [-1, 16, 32, 32, 32]               0
            ReLU-551       [-1, 16, 32, 32, 32]               0
            ReLU-552       [-1, 16, 32, 32, 32]               0
            ReLU-553       [-1, 16, 32, 32, 32]               0
            ReLU-554       [-1, 16, 32, 32, 32]               0
            ReLU-555       [-1, 16, 32, 32, 32]               0
            ReLU-556       [-1, 16, 32, 32, 32]               0
            ReLU-557       [-1, 16, 32, 32, 32]               0
            ReLU-558       [-1, 16, 32, 32, 32]               0
            ReLU-559       [-1, 16, 32, 32, 32]               0
            ReLU-560       [-1, 16, 32, 32, 32]               0
            ReLU-561       [-1, 16, 32, 32, 32]               0
            ReLU-562       [-1, 16, 32, 32, 32]               0
            ReLU-563       [-1, 16, 32, 32, 32]               0
            ReLU-564       [-1, 16, 32, 32, 32]               0
            ReLU-565       [-1, 16, 32, 32, 32]               0
            ReLU-566       [-1, 16, 32, 32, 32]               0
   IdentityBlock-567       [-1, 16, 32, 32, 32]               0
        Upsample-568       [-1, 16, 64, 64, 64]               0
          Conv3d-569        [-1, 4, 64, 64, 64]           1,732
     BatchNorm3d-570        [-1, 4, 64, 64, 64]               8
            ReLU-571        [-1, 4, 64, 64, 64]               0
            ReLU-572        [-1, 4, 64, 64, 64]               0
            ReLU-573        [-1, 4, 64, 64, 64]               0
            ReLU-574        [-1, 4, 64, 64, 64]               0
            ReLU-575        [-1, 4, 64, 64, 64]               0
            ReLU-576        [-1, 4, 64, 64, 64]               0
            ReLU-577        [-1, 4, 64, 64, 64]               0
            ReLU-578        [-1, 4, 64, 64, 64]               0
            ReLU-579        [-1, 4, 64, 64, 64]               0
            ReLU-580        [-1, 4, 64, 64, 64]               0
            ReLU-581        [-1, 4, 64, 64, 64]               0
            ReLU-582        [-1, 4, 64, 64, 64]               0
            ReLU-583        [-1, 4, 64, 64, 64]               0
            ReLU-584        [-1, 4, 64, 64, 64]               0
            ReLU-585        [-1, 4, 64, 64, 64]               0
            ReLU-586        [-1, 4, 64, 64, 64]               0
            ReLU-587        [-1, 4, 64, 64, 64]               0
          Conv3d-588       [-1, 16, 64, 64, 64]           1,744
     BatchNorm3d-589       [-1, 16, 64, 64, 64]              32
          Conv3d-590       [-1, 16, 64, 64, 64]             272
     BatchNorm3d-591       [-1, 16, 64, 64, 64]              32
            ReLU-592       [-1, 16, 64, 64, 64]               0
            ReLU-593       [-1, 16, 64, 64, 64]               0
            ReLU-594       [-1, 16, 64, 64, 64]               0
            ReLU-595       [-1, 16, 64, 64, 64]               0
            ReLU-596       [-1, 16, 64, 64, 64]               0
            ReLU-597       [-1, 16, 64, 64, 64]               0
            ReLU-598       [-1, 16, 64, 64, 64]               0
            ReLU-599       [-1, 16, 64, 64, 64]               0
            ReLU-600       [-1, 16, 64, 64, 64]               0
            ReLU-601       [-1, 16, 64, 64, 64]               0
            ReLU-602       [-1, 16, 64, 64, 64]               0
            ReLU-603       [-1, 16, 64, 64, 64]               0
            ReLU-604       [-1, 16, 64, 64, 64]               0
            ReLU-605       [-1, 16, 64, 64, 64]               0
            ReLU-606       [-1, 16, 64, 64, 64]               0
            ReLU-607       [-1, 16, 64, 64, 64]               0
            ReLU-608       [-1, 16, 64, 64, 64]               0
       ConvBlock-609       [-1, 16, 64, 64, 64]               0
          Conv3d-610        [-1, 4, 64, 64, 64]           1,732
     BatchNorm3d-611        [-1, 4, 64, 64, 64]               8
            ReLU-612        [-1, 4, 64, 64, 64]               0
            ReLU-613        [-1, 4, 64, 64, 64]               0
            ReLU-614        [-1, 4, 64, 64, 64]               0
            ReLU-615        [-1, 4, 64, 64, 64]               0
            ReLU-616        [-1, 4, 64, 64, 64]               0
            ReLU-617        [-1, 4, 64, 64, 64]               0
            ReLU-618        [-1, 4, 64, 64, 64]               0
            ReLU-619        [-1, 4, 64, 64, 64]               0
            ReLU-620        [-1, 4, 64, 64, 64]               0
            ReLU-621        [-1, 4, 64, 64, 64]               0
            ReLU-622        [-1, 4, 64, 64, 64]               0
            ReLU-623        [-1, 4, 64, 64, 64]               0
            ReLU-624        [-1, 4, 64, 64, 64]               0
            ReLU-625        [-1, 4, 64, 64, 64]               0
            ReLU-626        [-1, 4, 64, 64, 64]               0
            ReLU-627        [-1, 4, 64, 64, 64]               0
            ReLU-628        [-1, 4, 64, 64, 64]               0
          Conv3d-629       [-1, 16, 64, 64, 64]           1,744
     BatchNorm3d-630       [-1, 16, 64, 64, 64]              32
            ReLU-631       [-1, 16, 64, 64, 64]               0
            ReLU-632       [-1, 16, 64, 64, 64]               0
            ReLU-633       [-1, 16, 64, 64, 64]               0
            ReLU-634       [-1, 16, 64, 64, 64]               0
            ReLU-635       [-1, 16, 64, 64, 64]               0
            ReLU-636       [-1, 16, 64, 64, 64]               0
            ReLU-637       [-1, 16, 64, 64, 64]               0
            ReLU-638       [-1, 16, 64, 64, 64]               0
            ReLU-639       [-1, 16, 64, 64, 64]               0
            ReLU-640       [-1, 16, 64, 64, 64]               0
            ReLU-641       [-1, 16, 64, 64, 64]               0
            ReLU-642       [-1, 16, 64, 64, 64]               0
            ReLU-643       [-1, 16, 64, 64, 64]               0
            ReLU-644       [-1, 16, 64, 64, 64]               0
            ReLU-645       [-1, 16, 64, 64, 64]               0
            ReLU-646       [-1, 16, 64, 64, 64]               0
            ReLU-647       [-1, 16, 64, 64, 64]               0
   IdentityBlock-648       [-1, 16, 64, 64, 64]               0
          Conv3d-649        [-1, 4, 64, 64, 64]           1,732
     BatchNorm3d-650        [-1, 4, 64, 64, 64]               8
            ReLU-651        [-1, 4, 64, 64, 64]               0
            ReLU-652        [-1, 4, 64, 64, 64]               0
            ReLU-653        [-1, 4, 64, 64, 64]               0
            ReLU-654        [-1, 4, 64, 64, 64]               0
            ReLU-655        [-1, 4, 64, 64, 64]               0
            ReLU-656        [-1, 4, 64, 64, 64]               0
            ReLU-657        [-1, 4, 64, 64, 64]               0
            ReLU-658        [-1, 4, 64, 64, 64]               0
            ReLU-659        [-1, 4, 64, 64, 64]               0
            ReLU-660        [-1, 4, 64, 64, 64]               0
            ReLU-661        [-1, 4, 64, 64, 64]               0
            ReLU-662        [-1, 4, 64, 64, 64]               0
            ReLU-663        [-1, 4, 64, 64, 64]               0
            ReLU-664        [-1, 4, 64, 64, 64]               0
            ReLU-665        [-1, 4, 64, 64, 64]               0
            ReLU-666        [-1, 4, 64, 64, 64]               0
            ReLU-667        [-1, 4, 64, 64, 64]               0
          Conv3d-668       [-1, 16, 64, 64, 64]           1,744
     BatchNorm3d-669       [-1, 16, 64, 64, 64]              32
          Conv3d-670       [-1, 16, 64, 64, 64]             272
     BatchNorm3d-671       [-1, 16, 64, 64, 64]              32
            ReLU-672       [-1, 16, 64, 64, 64]               0
            ReLU-673       [-1, 16, 64, 64, 64]               0
            ReLU-674       [-1, 16, 64, 64, 64]               0
            ReLU-675       [-1, 16, 64, 64, 64]               0
            ReLU-676       [-1, 16, 64, 64, 64]               0
            ReLU-677       [-1, 16, 64, 64, 64]               0
            ReLU-678       [-1, 16, 64, 64, 64]               0
            ReLU-679       [-1, 16, 64, 64, 64]               0
            ReLU-680       [-1, 16, 64, 64, 64]               0
            ReLU-681       [-1, 16, 64, 64, 64]               0
            ReLU-682       [-1, 16, 64, 64, 64]               0
            ReLU-683       [-1, 16, 64, 64, 64]               0
            ReLU-684       [-1, 16, 64, 64, 64]               0
            ReLU-685       [-1, 16, 64, 64, 64]               0
            ReLU-686       [-1, 16, 64, 64, 64]               0
            ReLU-687       [-1, 16, 64, 64, 64]               0
            ReLU-688       [-1, 16, 64, 64, 64]               0
       ConvBlock-689       [-1, 16, 64, 64, 64]               0
      VAEDecoder-690       [-1, 16, 64, 64, 64]               0
================================================================
Total params: 10,570,528
Trainable params: 10,570,528
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 1.00
Forward/backward pass size (MB): 3610.82
Params size (MB): 40.32
Estimated Total Size (MB): 3652.14
----------------------------------------------------------------
